<script setup>
import { ref } from 'vue';
import { Swiper, SwiperSlide } from 'swiper/vue';
import { Navigation } from 'swiper';
import 'swiper/scss';

const prev = ref(null);
const next = ref(null);

const sliderModules = [Navigation]

// const test = (e) => alert(e.target.value);
</script>

<template>
    <div class="main">
        <div class="main__top">
            <div class="container-main">
                <div class="main__registration registration">
                    <div class="registration__content">
                        <div class="registration__content_left">
                            <div class="registration__field">
                                <div class="registration__logo">
                                    <img width="240" src="@/app/assets/image/logo.png" alt="Лого">
                                </div>
                                <div class="registration__title">В этот раз я найду свою любовь!</div>
                                <form class="registration__form" @submit.prevent="">
                                    <div class="registarion__gender">
                                        <UiTitleField>Я</UiTitleField>
                                        <div class="registarion__gender_switch">
                                            <label>
                                                <input type="radio" name="gender" value="man">
                                                <span>
                                                    <span>Мужчина</span>
                                                    <svg width="18" height="18" viewBox="0 0 17 18" fill="none"
                                                        xmlns="http://www.w3.org/2000/svg">
                                                        <path fill-rule="evenodd" clip-rule="evenodd"
                                                            d="M13.74 2.5H12v-2h5v5h-2V4.087L12.57 6.76a7 7 0 1 1-1.428-1.403L13.74 2.5ZM7 16A5 5 0 1 0 7 6a5 5 0 0 0 0 10Z"
                                                            fill="#fff"></path>
                                                    </svg>
                                                </span>
                                            </label>
                                            <label>
                                                <input type="radio" name="gender" value="woman">
                                                <span>
                                                    <svg width="21" height="21" viewBox="0 0 14 21" fill="none"
                                                        xmlns="http://www.w3.org/2000/svg">
                                                        <path fill-rule="evenodd" clip-rule="evenodd"
                                                            d="M7 12A5 5 0 1 0 7 2a5 5 0 0 0 0 10Zm7-5a7.001 7.001 0 0 1-6 6.93v2.57h2.5v2H8V21H6v-2.5H3.5v-2H6v-2.57A7.001 7.001 0 0 1 7 0a7 7 0 0 1 7 7Z"
                                                            fill="#fff"></path>
                                                    </svg>
                                                    <span>Женщина</span>
                                                </span>
                                            </label>
                                        </div>
                                    </div>
                                    <div class="">
                                        <UiInput></UiInput>
                                    </div>
                                    <UiButtonRed class="registration__button" type="submit">Продолжить</UiButtonRed>
                                </form>
                                <div class="registration__socials">
                                    <a class="registration__social _facebook" href="">
                                        <img width="21" height="21" src="@/app/assets/image/facebook.png" alt="Facebook">
                                        <span>Регистрация Facebook</span>
                                    </a>
                                    <a class="registration__social _google" href="">
                                        <img width="21" height="21" src="@/app/assets/image/google.png" alt="Google">
                                        <span>Регистрация Google</span>
                                    </a>
                                </div>
                            </div>
                        </div>
                        <div class="registration__content_right">
                            <UiButton class="registration__log">
                                <svg data-v-12e41b4d="" width="24" height="16" viewBox="0 0 27 18"
                                    xmlns="http://www.w3.org/2000/svg" class="auth-btn__icon icon-right">
                                    <path data-v-12e41b4d=""
                                        d="M2.75.76h16.5c1.008 0 1.833.824 1.833 1.833V6.25H19.25V2.574H2.75v12.861h16.5V11.75h1.833v3.676a1.823 1.823 0 0 1-1.833 1.815H2.75a1.823 1.823 0 0 1-1.833-1.815V2.593c0-1.018.825-1.834 1.833-1.834Zm20.667 11.907L27.083 9l-3.666-3.667v2.75H14.25v1.834h9.167v2.75Z"
                                        fill="#FFF" fill-rule="evenodd"></path>
                                </svg>
                                <span>Войти</span>
                            </UiButton>
                        </div>
                    </div>
                </div>
            </div>
        </div>

        <div class="main__peoples">
            <div class="container-main">
                <div class="main__peoples_slider">
                    <div ref="prev">
                        <svg width="37" height="102" viewBox="0 0 37 102" fill="none" xmlns="http://www.w3.org/2000/svg">
                            <path
                                d="M28.5309 3.06121C29.5071 1.37055 31.6689 0.791289 33.3596 1.76739V1.76739C35.0502 2.7435 35.6295 4.90534 34.6534 6.59601L6.12258 56.0128L4.33027 54.978C1.93881 53.5973 1.11943 50.5393 2.50015 48.1479L28.5309 3.06121Z"
                                fill="#D9D9D9" />
                            <path
                                d="M34.6535 94.8641C35.6296 96.5547 35.0503 98.7166 33.3597 99.6927V99.6927C31.669 100.669 29.5072 100.09 28.5311 98.3989L2.50027 53.3122C1.11956 50.9207 1.93893 47.8628 4.3304 46.4821L6.12271 45.4473L34.6535 94.8641Z"
                                fill="#D9D9D9" />
                        </svg>
                    </div>
                    <Swiper :breakpoints="{
                        1366: {
                            slidesPerView: 5
                        },
                        1024: {
                            slidesPerView: 4
                        },
                        768: {
                            slidesPerView: 3
                        },
                        520: {
                            slidesPerView: 2
                        },
                    }" :space-between="10" :navigation="{
    prevEl: prev,
    nextEl: next,
}" :modules="sliderModules">

                        <SwiperSlide>
                            <div class="slide">
                                <div class="slide__top">
                                    <div class="slide__info">
                                        <div>Имя, 23</div>
                                        <div class="slide__online"></div>
                                    </div>
                                    <div class="slide__photo">
                                        <svg width="13" height="13" viewBox="0 0 13 13" xmlns="http://www.w3.org/2000/svg">
                                            <path
                                                d="M12.75 9V1.5c0-.688-.563-1.25-1.25-1.25H4c-.688 0-1.25.563-1.25 1.25V9c0 .688.563 1.25 1.25 1.25h7.5c.688 0 1.25-.563 1.25-1.25ZM5.875 6.5l1.269 1.694L9 5.875 11.5 9H4l1.875-2.5ZM.25 2.75v8.75c0 .688.563 1.25 1.25 1.25h8.75V11.5H1.5V2.75H.25Z"
                                                fill-rule="evenodd"></path>
                                        </svg>
                                        <span>7 фото</span>
                                    </div>
                                </div>
                                <img class="slide__img" src="https://nataliedate.com/assets/img/girls/28.png" alt="">
                                <div class="slide__bottom">
                                    <button class="slide__button">
                                        <span>Написать</span>
                                        <svg width="18" height="18" viewBox="0 0 18 14" xmlns="http://www.w3.org/2000/svg">
                                            <path d="M4.845 13.93 17.923 1.646.007.641l1.874 5.17 11.613-2.554L2.956 8.765z"
                                                fill="#189BE4" fill-rule="evenodd"></path>
                                        </svg>
                                    </button>
                                    <button class="slide__button">
                                        <span>Лайк</span>
                                        <svg width="18" height="18" viewBox="0 0 17 16" xmlns="http://www.w3.org/2000/svg">
                                            <path
                                                d="M12.078 0C10.63 0 9.238.675 8.33 1.741A4.988 4.988 0 0 0 4.581 0C2.016 0 0 2.016 0 4.582c0 3.148 2.832 5.714 7.122 9.612l1.208 1.092 1.208-1.1c4.29-3.89 7.122-6.456 7.122-9.604C16.66 2.016 14.644 0 12.078 0Z"
                                                fill="#00B778" fill-rule="evenodd"></path>
                                        </svg>
                                    </button>
                                </div>
                            </div>
                        </SwiperSlide>
                        <SwiperSlide>Slide 2</SwiperSlide>
                        <SwiperSlide>Slide 3</SwiperSlide>
                        <SwiperSlide>Slide 3</SwiperSlide>
                        <SwiperSlide>Slide 3</SwiperSlide>
                        <SwiperSlide>Slide 3</SwiperSlide>
                    </Swiper>
                    <div ref="next" style="transform: rotate(180deg);">
                        <svg width="37" height="102" viewBox="0 0 37 102" fill="none" xmlns="http://www.w3.org/2000/svg">
                            <path
                                d="M28.5309 3.06121C29.5071 1.37055 31.6689 0.791289 33.3596 1.76739V1.76739C35.0502 2.7435 35.6295 4.90534 34.6534 6.59601L6.12258 56.0128L4.33027 54.978C1.93881 53.5973 1.11943 50.5393 2.50015 48.1479L28.5309 3.06121Z"
                                fill="#D9D9D9" />
                            <path
                                d="M34.6535 94.8641C35.6296 96.5547 35.0503 98.7166 33.3597 99.6927V99.6927C31.669 100.669 29.5072 100.09 28.5311 98.3989L2.50027 53.3122C1.11956 50.9207 1.93893 47.8628 4.3304 46.4821L6.12271 45.4473L34.6535 94.8641Z"
                                fill="#D9D9D9" />
                        </svg>
                    </div>
                </div>
                <UiButtonRed class="main__peoples_button">Регистрация</UiButtonRed>
            </div>
        </div>

        <div class="container-main">
            <div class="main__attraction attraction">
                <ul class="attraction__list">
                    <li class="attraction__item">
                        <svg xmlns="http://www.w3.org/2000/svg" viewBox="0 0 71.47 63.76" width="72" height="72">
                            <g id="icon1_svg__\u0421\u043B\u043E\u0439_2" data-name="\u0421\u043B\u043E\u0439 2">
                                <g id="icon1_svg__\u0421\u043B\u043E\u0439_1-2" data-name="\u0421\u043B\u043E\u0439 1">
                                    <g id="icon1_svg__icon1">
                                        <path fill="#ff3044"
                                            d="m35.74 63.76-.67-.37a95.85 95.85 0 0 1-20.14-15C9.09 42.61 3.64 36.7 1.15 27.48a34 34 0 0 1-.86-4.13A20.33 20.33 0 0 1 0 20 20 20 0 0 1 35.74 7.72 20 20 0 0 1 71.47 20a20.32 20.32 0 0 1-.28 3.39 38.3 38.3 0 0 1-.86 4.13c-2.49 9.22-7.94 15.13-13.79 20.86a95.6 95.6 0 0 1-20.14 15ZM20 2.73A17.25 17.25 0 0 0 2.73 20 17 17 0 0 0 3 22.9a35.17 35.17 0 0 0 .8 3.83c2.32 8.58 7.29 14 13.06 19.63a92.31 92.31 0 0 0 18.9 14.24 92.52 92.52 0 0 0 18.87-14.21c5.78-5.66 10.75-11 13.06-19.63a33 33 0 0 0 .8-3.83 17 17 0 0 0 .25-2.93 17.24 17.24 0 0 0-31.85-9.13l-1.15 1.85-1.16-1.85A17.16 17.16 0 0 0 20 2.73Z">
                                        </path>
                                        <path fill="#ff3044"
                                            d="M35.74 47.73a3.82 3.82 0 0 1-3.82-3.82v-8.79a8.73 8.73 0 0 1 3.47-16.58 8.73 8.73 0 0 1 9.08 8.72 8.76 8.76 0 0 1-4.91 7.86v8.79a3.83 3.83 0 0 1-3.82 3.82Zm0-26.47h-.25a6.05 6.05 0 0 0-5.75 5.66 6 6 0 0 0 4 6 1.35 1.35 0 0 1 .91 1.28v9.7a1.1 1.1 0 0 0 2.19 0v-9.7a1.35 1.35 0 0 1 .91-1.28 6 6 0 0 0-2-11.67Z">
                                        </path>
                                    </g>
                                </g>
                            </g>
                        </svg>
                        <div class="attraction__title">Безопасность</div>
                        <div class="attraction__description">Ваша безопасность обеспечивается ведущими системами защиты от
                            мошенничества.</div>
                    </li>
                    <li class="attraction__item">
                        <svg xmlns="http://www.w3.org/2000/svg" viewBox="0 0 70.96 70.96" width="72" height="72">
                            <g id="icon2_svg__\u0421\u043B\u043E\u0439_2" data-name="\u0421\u043B\u043E\u0439 2">
                                <g id="icon2_svg__\u0421\u043B\u043E\u0439_1-2" data-name="\u0421\u043B\u043E\u0439 1">
                                    <g id="icon2_svg__icon2">
                                        <path fill="#ff3044"
                                            d="M56.24 54.87V1.36A1.36 1.36 0 0 0 54.87 0H1.36A1.36 1.36 0 0 0 0 1.36v53.51a1.36 1.36 0 0 0 1.36 1.37h53.51a1.37 1.37 0 0 0 1.37-1.37Zm-2.73-1.36H2.73V2.73h50.78Z">
                                        </path>
                                        <path fill="#ff3044"
                                            d="M63.6 62.24V8.73a1.37 1.37 0 1 0-2.73 0v52.14H8.73a1.37 1.37 0 1 0 0 2.73h53.51a1.36 1.36 0 0 0 1.36-1.36Z">
                                        </path>
                                        <path fill="#ff3044"
                                            d="M69.6 14.72a1.37 1.37 0 0 0-1.37 1.37v52.14H16.09a1.37 1.37 0 1 0 0 2.73H69.6A1.36 1.36 0 0 0 71 69.6V16.09a1.36 1.36 0 0 0-1.4-1.37ZM34.6 24.15 25 15.08a1.52 1.52 0 0 1-.06-2.17 1.54 1.54 0 0 1 2.17-.06l7.44 7L46.89 7.52a1.53 1.53 0 0 1 2.17 2.17ZM8.91 33.84H9l1.27-4.72h1.31L9.6 35.57H8.17l-2-6.45h1.42ZM12.26 29.12h4.23v1.12h-3v1.5h2.74v1.13h-2.71v1.57h3v1.13h-4.26ZM17.71 29.19l.46-.07.49-.05H19.56a4.31 4.31 0 0 1 .88.09 2 2 0 0 1 .79.3 1.58 1.58 0 0 1 .55.57 1.72 1.72 0 0 1 .21.89 2.84 2.84 0 0 1-.08.69 2 2 0 0 1-.22.51 1.7 1.7 0 0 1-.33.38 4 4 0 0 1-.43.29l1.55 2.82H21L19.73 33H19v2.53h-1.29Zm1.94 1h-.38a1.43 1.43 0 0 0-.29 0v1.87h.49a1.43 1.43 0 0 0 .86-.24.92.92 0 0 0 .33-.79.83.83 0 0 0-.26-.65 1.06 1.06 0 0 0-.75-.23ZM23.17 34.44h1.63v-4.2h-1.63v-1.12h4.53v1.12h-1.64v4.2h1.64v1.13h-4.53ZM29 29.12h4.08v1.12h-2.85v1.6h2.62V33h-2.62v2.61H29ZM34.21 34.44h1.63v-4.2h-1.63v-1.12h4.53v1.12h-1.63v4.2h1.63v1.13h-4.53ZM39.89 29.12h4.22v1.12h-3v1.5h2.73v1.13h-2.69v1.57h3v1.13h-4.26Z">
                                        </path>
                                        <path fill="#ff3044"
                                            d="M45.23 29.12H47a3.44 3.44 0 0 1 1.42.25 2.19 2.19 0 0 1 .89.68 2.59 2.59 0 0 1 .45 1 5.91 5.91 0 0 1 .13 1.3 5.67 5.67 0 0 1-.13 1.24 2.76 2.76 0 0 1-.46 1.08 2.38 2.38 0 0 1-.93.77 3.52 3.52 0 0 1-1.52.29h-1.62Zm1.85 1H46.49v4.32H47a1.6 1.6 0 0 0 .85-.19 1.32 1.32 0 0 0 .48-.52 2.38 2.38 0 0 0 .2-.73 7.34 7.34 0 0 0 .05-.81v-.73a2.21 2.21 0 0 0-.2-.69 1.32 1.32 0 0 0-.45-.52 1.54 1.54 0 0 0-.85-.1ZM10 39.81v-1l-1 1.68h-.27L7.65 38.8H7.6l.06.9v3.54h-1.2v-6.45h1.28l1.11 1.79L10 36.79h1.27v6.45H10ZM12.26 36.79h4.23v1.13h-3v1.5h2.74v1.12h-2.71v1.58h3v1.12h-4.26ZM21 39.81v-1l-1 1.69h-.22l-1.08-1.7h-.05l.06.9v3.54h-1.2v-6.45h1.28l1.11 1.79 1.1-1.79h1.3v6.45H21ZM27.58 38.29a2 2 0 0 1-.06.48 1.35 1.35 0 0 1-.2.44 1.34 1.34 0 0 1-.36.35 1.7 1.7 0 0 1-.53.23v.05A2 2 0 0 1 27 40a1.19 1.19 0 0 1 .43.3 1.49 1.49 0 0 1 .29.47 1.86 1.86 0 0 1 .11.66 1.71 1.71 0 0 1-.21.86 1.69 1.69 0 0 1-.57.59 2.57 2.57 0 0 1-.81.34 4.08 4.08 0 0 1-.93.11h-1.49a3.64 3.64 0 0 1-.53-.09v-6.4l.4-.06h1.55a5.14 5.14 0 0 1 .88.07 2.71 2.71 0 0 1 .76.24 1.35 1.35 0 0 1 .54.49 1.41 1.41 0 0 1 .16.71Zm-2.73 1.21h.3a1.12 1.12 0 0 0 .29 0 1.82 1.82 0 0 0 .62-.32.73.73 0 0 0 .25-.58.75.75 0 0 0-.09-.39.72.72 0 0 0-.25-.24.82.82 0 0 0-.35-.13 1.84 1.84 0 0 0-.41 0h-.77v1.7Zm.41 2.77a2.12 2.12 0 0 0 .44-.05 1.1 1.1 0 0 0 .38-.17.94.94 0 0 0 .27-.29.76.76 0 0 0 .1-.41.8.8 0 0 0-.12-.47.74.74 0 0 0-.31-.27 1.19 1.19 0 0 0-.43-.12 3.87 3.87 0 0 0-.48 0h-.67v1.76H25.26ZM28.84 36.79h4.22v1.13h-3v1.5h2.73v1.12H30.1v1.58h3v1.12h-4.26ZM34.29 36.86l.45-.07h1.39a4.41 4.41 0 0 1 .89.09 2.44 2.44 0 0 1 .78.3 1.51 1.51 0 0 1 .55.57 1.75 1.75 0 0 1 .21.89 2.73 2.73 0 0 1-.08.69 2 2 0 0 1-.21.51 1.78 1.78 0 0 1-.34.38 2.16 2.16 0 0 1-.43.29l1.56 2.82H37.6l-1.3-2.52h-.75v2.52h-1.26Zm1.93 1h-.38a1.55 1.55 0 0 0-.29 0v1.87h.5a1.4 1.4 0 0 0 .85-.24.91.91 0 0 0 .33-.79.84.84 0 0 0-.25-.65 1.08 1.08 0 0 0-.76-.22ZM6.77 44.53a6.53 6.53 0 0 1 .85-.11h.92a6.42 6.42 0 0 1 1 .07 2.52 2.52 0 0 1 .87.32 1.87 1.87 0 0 1 .63.65 2.17 2.17 0 0 1 .24 1.09 2.25 2.25 0 0 1-.21 1 2 2 0 0 1-.56.69 2.5 2.5 0 0 1-.8.4 3.59 3.59 0 0 1-.93.12h-.75v2.22H6.77Zm1.87.93h-.35a1.56 1.56 0 0 0-.26 0v2.14h.54a2.63 2.63 0 0 0 .49 0 1.23 1.23 0 0 0 .44-.17.88.88 0 0 0 .31-.35 1.2 1.2 0 0 0 .11-.58 1 1 0 0 0-.11-.5.89.89 0 0 0-.29-.32 1.07 1.07 0 0 0-.41-.16 2.42 2.42 0 0 0-.47-.06ZM12.19 44.53l.46-.07.48-.05H14a4.4 4.4 0 0 1 .89.08 2.44 2.44 0 0 1 .78.3 1.51 1.51 0 0 1 .55.57 1.76 1.76 0 0 1 .21.9 2.31 2.31 0 0 1-.08.68 1.7 1.7 0 0 1-.21.51 1.57 1.57 0 0 1-.34.38 2.16 2.16 0 0 1-.43.29L17 50.91h-1.5l-1.29-2.52h-.76v2.52h-1.26Zm1.93 1h-.38a1.72 1.72 0 0 0-.29 0v1.87H14a1.4 1.4 0 0 0 .85-.24.89.89 0 0 0 .34-.79.86.86 0 0 0-.26-.65 1.13 1.13 0 0 0-.81-.22ZM17.47 47.69a6.1 6.1 0 0 1 .15-1.41 3 3 0 0 1 .45-1.05 2.08 2.08 0 0 1 .76-.66 2.42 2.42 0 0 1 1.08-.23 2.29 2.29 0 0 1 1.12.25 1.91 1.91 0 0 1 .75.69 3.09 3.09 0 0 1 .42 1.06 6.29 6.29 0 0 1 .14 1.35 4.26 4.26 0 0 1-.61 2.46 2 2 0 0 1-1.82.89 2.3 2.3 0 0 1-1.13-.25 2 2 0 0 1-.78-.69 3.18 3.18 0 0 1-.4-1.1 7 7 0 0 1-.13-1.31Zm1.33 0a8 8 0 0 0 0 .87 2.75 2.75 0 0 0 .16.71 1.11 1.11 0 0 0 .33.47.87.87 0 0 0 .58.18 1 1 0 0 0 .53-.14.89.89 0 0 0 .34-.41 2 2 0 0 0 .18-.69 9.31 9.31 0 0 0 .05-1v-.86a2.48 2.48 0 0 0-.15-.71 1.21 1.21 0 0 0-.33-.48.92.92 0 0 0-.59-.18.87.87 0 0 0-.9.55 4.72 4.72 0 0 0-.2 1.69ZM23.44 44.47h4.09v1.12H24.7v1.59h2.63v1.13H24.7v2.6h-1.26ZM28.69 49.79h1.63v-4.2h-1.63v-1.12h4.53v1.12h-1.64v4.2h1.64v1.12h-4.53ZM37.53 48.29h1.14v2.62h-4.23v-6.44h1.26v5.32h1.83ZM39.89 44.47h4.22v1.12h-3v1.5h2.73v1.12h-2.69v1.58h3v1.12h-4.26Z">
                                        </path>
                                    </g>
                                </g>
                            </g>
                        </svg>
                        <div class="attraction__title">Подтверждение</div>
                        <div class="attraction__description">Все профили проверяются администрацией, чтобы доказать, что они
                            настоящие.</div>
                    </li>
                    <li class="attraction__item">
                        <svg xmlns="http://www.w3.org/2000/svg" viewBox="0 0 107.22 63.56" width="72" height="72">
                            <g id="icon3_svg__\u0421\u043B\u043E\u0439_2" data-name="\u0421\u043B\u043E\u0439 2">
                                <g id="icon3_svg__\u0421\u043B\u043E\u0439_1-2" data-name="\u0421\u043B\u043E\u0439 1">
                                    <g id="icon3_svg__icon3">
                                        <path fill="#ff3044"
                                            d="M64.91 0a19.85 19.85 0 0 0-15.78 7.72A20 20 0 0 0 13.4 20a20.33 20.33 0 0 0 .29 3.39 34 34 0 0 0 .86 4.13C17 36.7 22.49 42.61 28.33 48.34a95.6 95.6 0 0 0 20.14 15 1.39 1.39 0 0 0 1.33 0 95.6 95.6 0 0 0 20.14-15c5.84-5.73 11.29-11.64 13.78-20.86a34 34 0 0 0 .86-4.13 20.33 20.33 0 0 0 .29-3.35A20 20 0 0 0 64.91 0Zm17 22.9a33 33 0 0 1-.8 3.83c-2.32 8.58-7.28 14-13.06 19.63a92.31 92.31 0 0 1-18.9 14.24 92.52 92.52 0 0 1-18.91-14.21c-5.78-5.66-10.74-11-13.06-19.63a33 33 0 0 1-.8-3.83 17 17 0 0 1-.25-2.93A17.24 17.24 0 0 1 48 10.83a1.36 1.36 0 0 0 2.31 0A17.24 17.24 0 0 1 81.89 22.9Z">
                                        </path>
                                        <path fill="#ff3044"
                                            d="M34 5.46a18.43 18.43 0 0 0-14.83 18.05 1.37 1.37 0 1 0 2.73 0A15.71 15.71 0 0 1 34.53 8.13 1.36 1.36 0 1 0 34 5.46ZM8.28 52c-4.57 0-6.63-1.22-7.83-3.29A3.39 3.39 0 0 1 .17 46c1.39-4.58 11.73-9.74 12.91-10.32a1.18 1.18 0 0 1 1.58.55 1.17 1.17 0 0 1-.54 1.58c-4.08 2-10.86 6.16-11.68 8.87a1 1 0 0 0 .05.89c1.8 3.08 7 4.57 52.16-8.39 43.26-12.41 50.67-23.9 50.18-26.08-.19-.87-5.49-1.8-13-1.21a1.18 1.18 0 0 1-.18-2.36c4.38-.35 14.67-.74 15.52 3.06 1 4.55-8.53 16.44-51.84 28.86C29 49 15.49 52 8.28 52Z">
                                        </path>
                                        <path fill="#ff3044"
                                            d="M93.55 17.29s-9.2-6.36-6.47-11.69c2.23-4.36 6.57.64 6.57.64s3.82-4.63 6.84-.89-6.94 11.94-6.94 11.94ZM40.15 49.08S31 42.72 33.67 37.4c2.23-4.4 6.57.6 6.57.6s3.82-4.62 6.84-.89-6.93 11.97-6.93 11.97Z">
                                        </path>
                                    </g>
                                </g>
                            </g>
                        </svg>
                        <div class="attraction__title">Интерес</div>
                        <div class="attraction__description">Получите много внимания от привлекательных участников рядом с
                            вами.</div>
                    </li>
                    <li class="attraction__item">
                        <svg xmlns="http://www.w3.org/2000/svg" viewBox="0 0 85.04 85.04" width="72PX" height="72PX">
                            <g data-name="\u0421\u043B\u043E\u0439 2">
                                <path
                                    d="M84.64 45.85 39.19.4a1.37 1.37 0 0 0-1.93 0L.4 37.26a1.37 1.37 0 0 0 0 1.93l45.45 45.45a1.34 1.34 0 0 0 1 .4 1.36 1.36 0 0 0 1-.4l36.79-36.86a1.37 1.37 0 0 0 0-1.93ZM49 79.54l-1.45-21a26.85 26.85 0 0 0 4.78-.41 17.61 17.61 0 0 0 9.51-4.74 11.25 11.25 0 0 0 3-5.24l14.67.85ZM26.88 32.7a26 26 0 0 0-.41 4.52L5.52 36 36 5.52l.85 14.69a11.24 11.24 0 0 0-5.23 3 17.61 17.61 0 0 0-4.74 9.49Zm6.67-7.58a8.64 8.64 0 0 1 12.22 12.22 1.36 1.36 0 0 0 0 1.93 1.37 1.37 0 0 0 1.93 0 8.64 8.64 0 0 1 12.22 12.22c-8.23 8.23-24.55 2.51-27.64 1.27-1.2-3.1-6.96-19.41 1.27-27.64Zm47.8 21.3-16.18-1a11.35 11.35 0 0 0-14.61-11 11.47 11.47 0 0 0 .44-3.19 11.37 11.37 0 0 0-11.34-11.37h-.09l-1-16.17Zm-77.66-7.8L26.55 40c.07.95.17 1.92.32 2.91A50 50 0 0 0 30 54.35a1.3 1.3 0 0 0 .71.71 50 50 0 0 0 11.48 3.11c.9.13 1.79.23 2.65.3l1.56 22.86Z"
                                    data-name="\u0421\u043B\u043E\u0439 1" fill="#ff3044"></path>
                            </g>
                        </svg>
                        <div class="attraction__title">Безопасность</div>
                        <div class="attraction__description">Ваша безопасность обеспечивается ведущими системами защиты от
                            мошенничества.</div>
                    </li>
                </ul>
            </div>
        </div>
    </div>
</template>

<style lang="scss" scoped>
@import './main.scss';
</style>